ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_bls.c
/******************************************************************************
* Function Name: Cy_BLE_BLSC_NotificationEventHandler
***************************************************************************//**
*
*  Handles a Notification event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_BLSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_BLS_ApplCallback != NULL) &&
       (cy_ble_blsc[discIdx].charInfo[CY_BLE_BLS_ICP].valueHandle == eventParam->handleValPair.attrHandle))
    {
        cy_stc_ble_bls_char_value_t locCharValue =
        {
            .connHandle = eventParam->connHandle,
            .charIndex  = CY_BLE_BLS_ICP,
            .value      = &eventParam->handleValPair.value
        };
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        Cy_BLE_BLS_ApplCallback((uint32_t)CY_BLE_EVT_BLSC_NOTIFICATION, &locCharValue);
    }
}


/******************************************************************************
* Function Name: Cy_BLE_BLSC_IndicationEventHandler
***************************************************************************//**
*
*  Handles an Indication event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_BLSC_IndicationEventHandler(cy_stc_ble_gattc_handle_value_ind_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_BLS_ApplCallback != NULL) &&
       (cy_ble_blsc[discIdx].charInfo[CY_BLE_BLS_BPM].valueHandle == eventParam->handleValPair.attrHandle))
    {
        cy_stc_ble_bls_char_value_t locCharValue =
        {
            .charIndex  = CY_BLE_BLS_BPM,
            .connHandle = eventParam->connHandle,
            .value      = &eventParam->handleValPair.value
        };
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        Cy_BLE_BLS_ApplCallback((uint32_t)CY_BLE_EVT_BLSC_INDICATION, &locCharValue);
    }
}


/******************************************************************************
* Function Name: Cy_BLE_BLSC_ReadResponseEventHandler
***************************************************************************//**
*
*  Handles a Read Response event.
*
*  \param cy_stc_ble_gattc_read_rsp_param_t *eventParam: The pointer to the data structure.
*
******************************************************************************/
static void Cy_BLE_BLSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_BLS_ApplCallback != NULL) &&
       (cy_ble_blscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        if(cy_ble_blsc[discIdx].charInfo[CY_BLE_BLS_BPF].valueHandle == cy_ble_blscReqHandle[discIdx])
        {
            cy_stc_ble_bls_char_value_t locCharValue =
            {
                .connHandle = eventParam->connHandle,
                .charIndex  = CY_BLE_BLS_BPF,
                .value      = &eventParam->value
            };
            cy_ble_blscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            Cy_BLE_BLS_ApplCallback((uint32_t)CY_BLE_EVT_BLSC_READ_CHAR_RESPONSE, &locCharValue);
        }
        else
        {
            cy_en_ble_bls_char_index_t i;

            for(i = CY_BLE_BLS_BPM; i < CY_BLE_BLS_BPF; i++)
            {
                if(cy_ble_blsc[discIdx].charInfo[i].cccdHandle == cy_ble_blscReqHandle[discIdx])
                {
                    cy_stc_ble_bls_descr_value_t locDescrValue =
                    {
                        .connHandle = eventParam->connHandle,
                        .charIndex  = i,
                        .descrIndex = CY_BLE_BLS_CCCD,
                        .value      = &eventParam->value
                    };
                    cy_ble_blscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                    cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                    Cy_BLE_BLS_ApplCallback((uint32_t)CY_BLE_EVT_BLSC_READ_DESCR_RESPONSE, &locDescrValue);
                    break;
                }
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_BLSC_WriteResponseEventHandler
***************************************************************************//**
*
*  Handles a Write Response event.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_BLSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_BLS_ApplCallback != NULL) &&
       (cy_ble_blscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        cy_en_ble_bls_char_index_t i;
        for(i = CY_BLE_BLS_BPM; i < CY_BLE_BLS_BPF; i++)
        {
            if(cy_ble_blsc[discIdx].charInfo[i].cccdHandle == cy_ble_blscReqHandle[discIdx])
            {
                cy_stc_ble_bls_descr_value_t locDescIndex =
                {
                    .connHandle = *eventParam,
                    .charIndex  = i,
                    .descrIndex = CY_BLE_BLS_CCCD,
                    .value      = NULL
                };
                cy_ble_blscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                Cy_BLE_BLS_ApplCallback((uint32_t)CY_BLE_EVT_BLSC_WRITE_DESCR_RESPONSE, &locDescIndex);
                break;
            }
        }
    }
}


